In [ ]:
# https://www.youtube.com/watch?v=A4FOv1dL2to

In [40]:
import pandas as pd
import numpy as np

In [41]:
df4 = pd.read_csv('F:\Dept\Machine Learning\Lectures\Week 3 Data Preprocessing\Data Preprocessing\EmpData4.csv')

In [42]:
display(df4)

         Name  Age    Education   Salary    Designation       City
0        Raja   32          M.Sc  100000             GM    Karachi
1  Khadim Ali   25          B.Sc   75000  Superitendent  Hyderabad
2       Babar   45  Intermediate   50000          Clerk     Sukkur
3  Rashid Ali   25        Matric   35000           Peon    Karachi
4       Qasim   57           M.A   90000        Manager  Hyderabad
5       Majid   28           B.A   76000     Head Clerk     Sukkur

In [43]:
df4.drop(['City', 'Age'], axis=1, inplace=True)
# axis=0: This refers to operations along rows, where you perform an 
# operation on elements within the same row

# axis=1: This refers to operations along columns, where you perform 
# an operation on elements within the same column.

# inplace=True: If you set inplace=True, the DataFrame will be modified 
# in place, and the changes will be applied directly to the original 
# DataFrame.

In [44]:
display(df4)

         Name    Education   Salary    Designation
0        Raja          M.Sc  100000             GM
1  Khadim Ali          B.Sc   75000  Superitendent
2       Babar  Intermediate   50000          Clerk
3  Rashid Ali        Matric   35000           Peon
4       Qasim           M.A   90000        Manager
5       Majid           B.A   76000     Head Clerk